In [7]:
import pandas as pd
df = pd.read_excel('SaleData.xlsx')
#print(df)
import numpy as np

In [4]:
df.head(2)

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0

# Pivot

## create pivot with multiple index (Manager and SalesMan)

In [3]:
import numpy as np
import pandas as pd
sales_data = pd.read_excel("resources/SaleData.xlsx")
df = pd.DataFrame(sales_data)
pd.pivot_table(df, index = ["Manager", "SalesMan"])

                       Sale_amt   Unit_price      Units
Manager SalesMan
Douglas John       41338.666667   607.666667  52.000000
        Karen      16068.000000   261.166667  56.666667
        Michael    33418.000000   849.000000  44.500000
Hermann Luis       41274.600000   690.900000  56.200000
        Shelli      8424.500000   185.500000  48.250000
        Sigal      41679.166667   585.500000  57.666667
Martha  Alexander  29587.875000   529.750000  49.500000
        Diana      18050.000000   362.500000  62.500000
        Steven     49922.500000  1023.500000  45.750000
Timothy David      28191.000000   724.200000  42.600000
        Stephen    22015.750000   512.000000  35.500000

## Create a Pivot table and find the total sale amount region wise, manager wise

In [4]:
import numpy as np
import pandas as pd
sales_data = pd.read_excel("resources/SaleData.xlsx")
df = pd.DataFrame(sales_data)
pd.pivot_table(df, index = ["Region", "Manager"], values = "Sale_amt")

                     Sale_amt
Region  Manager
Central Douglas  41338.666667
        Hermann  30425.708333
        Martha   49922.500000
        Timothy  28191.000000
East    Douglas  16068.000000
        Martha   27280.300000
West    Douglas  33418.000000
        Timothy  22015.750000

## item wise unit sold

In [16]:
df.head(2)

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0

## count the manager wise sale and mean value of sale amount

## find manager wise, salesman wise total sale and also display the sum of all sale amount at the bottom

## find the total sale amount region wise, manager wise, sales man wise

## find the maximum and minimum sale value of the items

# Pandas Style exercise

In [56]:
import pandas as pd
df = pd.read_csv('resources/pandas_style.csv')

## write a function to show red for value less than zero and others as blue

## Highlight null value with red color

## Highlight maximum value from each column with green color

## background color to pink and blue